#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/devperimental/package-setup/runs/run-Ltsz2KFqq7vFjHTU

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
github_branch_protection.template-repo["component-settings"]: Refreshing state... [id=BPR_kwDOJCfPss4CEZ5j]
github_branch_protection.template-repo["component-externalapis"]: Refreshing state... [id=BPR_kwDOJCfPt84CEZ5a]
github_branch_protection.template-repo["component-queues"]: Refreshing state... [id=BPR_kwDOJFIBWc4CFS98]
github_branch_protection.template-repo["component-sms"]: Refreshing state... [id=BPR_kwDOJCfPls4CEZ5c]
github_branch_protection.template-repo["component-email"]: Refreshing state... [id=BPR_kwDOJCfPzc4CEZ5i]
github_branch_protection.template-repo["component-payments"]: Refreshing state... [id=BPR_kwDOJCfPqc4CEZ5e]
github_branch_protection.template-repo["component-servicehelper"]: Refreshing state... [id=BPR_kwDOJCfP0s4CEZ5d]
github_branch_protection.template-repo["component-dataaccess"]: Refreshing state... [id=BPR_kwDOJCfPns4CEZ5f]
github_branch_protection.template-repo["component-storage"]: Refreshing state... [id=BPR_kwDOJFIBVs4CFS97]
github_repository_collaborator.a_repo_collaborator["component-servicehelper"]: Refreshing state... [id=component-servicehelper:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-settings"]: Refreshing state... [id=component-settings:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-payments"]: Refreshing state... [id=component-payments:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-dataaccess"]: Refreshing state... [id=component-dataaccess:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-sms"]: Refreshing state... [id=component-sms:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-storage"]: Refreshing state... [id=component-storage:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-queues"]: Refreshing state... [id=component-queues:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-email"]: Refreshing state... [id=component-email:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-externalapis"]: Refreshing state... [id=component-externalapis:chrisxpr]
github_repository.template-repo["component-sms"]: Refreshing state... [id=component-sms]
github_repository.template-repo["component-dataaccess"]: Refreshing state... [id=component-dataaccess]
github_repository.template-repo["component-servicehelper"]: Refreshing state... [id=component-servicehelper]
github_repository.template-repo["component-settings"]: Refreshing state... [id=component-settings]
github_repository.template-repo["component-externalapis"]: Refreshing state... [id=component-externalapis]
github_repository.template-repo["component-storage"]: Refreshing state... [id=component-storage]
github_repository.template-repo["component-payments"]: Refreshing state... [id=component-payments]
github_repository.template-repo["component-queues"]: Refreshing state... [id=component-queues]
github_repository.template-repo["component-email"]: Refreshing state... [id=component-email]
github_actions_secret.repo_secret["component-queues"]: Refreshing state... [id=component-queues:NUGET_PAT]
github_actions_secret.repo_secret["component-storage"]: Refreshing state... [id=component-storage:NUGET_PAT]
github_actions_secret.repo_secret["component-externalapis"]: Refreshing state... [id=component-externalapis:NUGET_PAT]
github_actions_secret.repo_secret["component-servicehelper"]: Refreshing state... [id=component-servicehelper:NUGET_PAT]
github_actions_secret.repo_secret["component-settings"]: Refreshing state... [id=component-settings:NUGET_PAT]
github_actions_secret.repo_secret["component-dataaccess"]: Refreshing state... [id=component-dataaccess:NUGET_PAT]
github_actions_secret.repo_secret["component-email"]: Refreshing state... [id=component-email:NUGET_PAT]
github_actions_secret.repo_secret["component-sms"]: Refreshing state... [id=component-sms:NUGET_PAT]
github_actions_secret.repo_secret["component-payments"]: Refreshing state... [id=component-payments:NUGET_PAT]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_actions_secret.repo_secret["component-api-extensions"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-api-extensions"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["frontend-client-api"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "frontend-client-api"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["frontend-management-api"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "frontend-management-api"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["frontend-portal-api"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "frontend-portal-api"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.repo-protection["component-api-extensions"] will be created
  + resource "github_branch_protection" "repo-protection" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.repo-protection["component-dataaccess"] will be created
  + resource "github_branch_protection" "repo-protection" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "R_kgDOJCfPng"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.repo-protection["component-email"] will be created
  + resource "github_branch_protection" "repo-protection" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "R_kgDOJCfPzQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.repo-protection["component-externalapis"] will be created
  + resource "github_branch_protection" "repo-protection" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "R_kgDOJCfPtw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.repo-protection["component-payments"] will be created
  + resource "github_branch_protection" "repo-protection" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "R_kgDOJCfPqQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.repo-protection["component-queues"] will be created
  + resource "github_branch_protection" "repo-protection" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "R_kgDOJFIBWQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.repo-protection["component-servicehelper"] will be created
  + resource "github_branch_protection" "repo-protection" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "R_kgDOJCfP0g"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.repo-protection["component-settings"] will be created
  + resource "github_branch_protection" "repo-protection" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "R_kgDOJCfPsg"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.repo-protection["component-sms"] will be created
  + resource "github_branch_protection" "repo-protection" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "R_kgDOJCfPlg"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.repo-protection["component-storage"] will be created
  + resource "github_branch_protection" "repo-protection" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "R_kgDOJFIBVg"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.standard-repo-protection["frontend-client-api"] will be created
  + resource "github_branch_protection" "standard-repo-protection" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.standard-repo-protection["frontend-management-api"] will be created
  + resource "github_branch_protection" "standard-repo-protection" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.standard-repo-protection["frontend-portal-api"] will be created
  + resource "github_branch_protection" "standard-repo-protection" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.template-repo["component-dataaccess"] will be destroyed
  # (because github_branch_protection.template-repo is not in configuration)
  - resource "github_branch_protection" "template-repo" {
      - allows_deletions                = true -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - id                              = "BPR_kwDOJCfPns4CEZ5f" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "R_kgDOJCfPng" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }
    }

  # github_branch_protection.template-repo["component-email"] will be destroyed
  # (because github_branch_protection.template-repo is not in configuration)
  - resource "github_branch_protection" "template-repo" {
      - allows_deletions                = true -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - id                              = "BPR_kwDOJCfPzc4CEZ5i" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "R_kgDOJCfPzQ" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }
    }

  # github_branch_protection.template-repo["component-externalapis"] will be destroyed
  # (because github_branch_protection.template-repo is not in configuration)
  - resource "github_branch_protection" "template-repo" {
      - allows_deletions                = true -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - id                              = "BPR_kwDOJCfPt84CEZ5a" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "R_kgDOJCfPtw" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }
    }

  # github_branch_protection.template-repo["component-payments"] will be destroyed
  # (because github_branch_protection.template-repo is not in configuration)
  - resource "github_branch_protection" "template-repo" {
      - allows_deletions                = true -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - id                              = "BPR_kwDOJCfPqc4CEZ5e" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "R_kgDOJCfPqQ" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }
    }

  # github_branch_protection.template-repo["component-queues"] will be destroyed
  # (because github_branch_protection.template-repo is not in configuration)
  - resource "github_branch_protection" "template-repo" {
      - allows_deletions                = true -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - id                              = "BPR_kwDOJFIBWc4CFS98" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "R_kgDOJFIBWQ" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }
    }

  # github_branch_protection.template-repo["component-servicehelper"] will be destroyed
  # (because github_branch_protection.template-repo is not in configuration)
  - resource "github_branch_protection" "template-repo" {
      - allows_deletions                = true -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - id                              = "BPR_kwDOJCfP0s4CEZ5d" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "R_kgDOJCfP0g" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }
    }

  # github_branch_protection.template-repo["component-settings"] will be destroyed
  # (because github_branch_protection.template-repo is not in configuration)
  - resource "github_branch_protection" "template-repo" {
      - allows_deletions                = true -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - id                              = "BPR_kwDOJCfPss4CEZ5j" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "R_kgDOJCfPsg" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }
    }

  # github_branch_protection.template-repo["component-sms"] will be destroyed
  # (because github_branch_protection.template-repo is not in configuration)
  - resource "github_branch_protection" "template-repo" {
      - allows_deletions                = true -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - id                              = "BPR_kwDOJCfPls4CEZ5c" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "R_kgDOJCfPlg" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }
    }

  # github_branch_protection.template-repo["component-storage"] will be destroyed
  # (because github_branch_protection.template-repo is not in configuration)
  - resource "github_branch_protection" "template-repo" {
      - allows_deletions                = true -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - id                              = "BPR_kwDOJFIBVs4CFS97" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "R_kgDOJFIBVg" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }
    }

  # github_repository.standard-repo["frontend-client-api"] will be created
  + resource "github_repository" "standard-repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Front End Client API Repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "frontend-client-api"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
    }

  # github_repository.standard-repo["frontend-management-api"] will be created
  + resource "github_repository" "standard-repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Front End Management API Repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "frontend-management-api"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
    }

  # github_repository.standard-repo["frontend-portal-api"] will be created
  + resource "github_repository" "standard-repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Front End Portal API Repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "frontend-portal-api"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
    }

  # github_repository.template-repo["component-api-extensions"] will be created
  + resource "github_repository" "template-repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "API Extension Repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "component-api-extensions"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + template {
          + owner      = "devperimental"
          + repository = "nuget-package-template"
        }
    }

  # github_repository_collaborator.a_repo_collaborator["component-api-extensions"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "component-api-extensions"
      + username                    = "chrisxpr"
    }

  # github_repository_collaborator.a_repo_collaborator["frontend-client-api"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "frontend-client-api"
      + username                    = "chrisxpr"
    }

  # github_repository_collaborator.a_repo_collaborator["frontend-management-api"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "frontend-management-api"
      + username                    = "chrisxpr"
    }

  # github_repository_collaborator.a_repo_collaborator["frontend-portal-api"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "frontend-portal-api"
      + username                    = "chrisxpr"
    }

Plan: 25 to add, 0 to change, 9 to destroy.


```

</details>

*Pushed by: @chrisxpr, Action: `pull_request`*